app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first", "last", "password", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-10-07 00:27:15.059960"], ["email", "jay@cruz.com"], ["first", "Jay"], ["last", "Cruz"], ["password", "password"], ["updated_at", "2014-10-07 00:27:15.059960"]]
---
	def create
		@user = User.new(user_params)
		if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 40]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 40]]
---
	def destroy
		if User.find(@user).destroy